###################################################################

# Created by write_sdc on Sun Nov 10 21:35:05 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.15 [current_design]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports clk]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports reset]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports enable]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[31]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[30]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[29]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[28]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[27]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[26]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[25]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[24]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[23]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[22]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[21]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[20]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[19]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[18]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[17]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[16]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataA[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[31]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[30]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[29]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[28]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[27]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[26]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[25]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[24]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[23]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[22]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[21]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[20]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[19]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[18]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[17]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[16]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {idataB[0]}]
set_load -pin_load 0.3 [get_ports {odata[31]}]
set_load -pin_load 0.3 [get_ports {odata[30]}]
set_load -pin_load 0.3 [get_ports {odata[29]}]
set_load -pin_load 0.3 [get_ports {odata[28]}]
set_load -pin_load 0.3 [get_ports {odata[27]}]
set_load -pin_load 0.3 [get_ports {odata[26]}]
set_load -pin_load 0.3 [get_ports {odata[25]}]
set_load -pin_load 0.3 [get_ports {odata[24]}]
set_load -pin_load 0.3 [get_ports {odata[23]}]
set_load -pin_load 0.3 [get_ports {odata[22]}]
set_load -pin_load 0.3 [get_ports {odata[21]}]
set_load -pin_load 0.3 [get_ports {odata[20]}]
set_load -pin_load 0.3 [get_ports {odata[19]}]
set_load -pin_load 0.3 [get_ports {odata[18]}]
set_load -pin_load 0.3 [get_ports {odata[17]}]
set_load -pin_load 0.3 [get_ports {odata[16]}]
set_load -pin_load 0.3 [get_ports {odata[15]}]
set_load -pin_load 0.3 [get_ports {odata[14]}]
set_load -pin_load 0.3 [get_ports {odata[13]}]
set_load -pin_load 0.3 [get_ports {odata[12]}]
set_load -pin_load 0.3 [get_ports {odata[11]}]
set_load -pin_load 0.3 [get_ports {odata[10]}]
set_load -pin_load 0.3 [get_ports {odata[9]}]
set_load -pin_load 0.3 [get_ports {odata[8]}]
set_load -pin_load 0.3 [get_ports {odata[7]}]
set_load -pin_load 0.3 [get_ports {odata[6]}]
set_load -pin_load 0.3 [get_ports {odata[5]}]
set_load -pin_load 0.3 [get_ports {odata[4]}]
set_load -pin_load 0.3 [get_ports {odata[3]}]
set_load -pin_load 0.3 [get_ports {odata[2]}]
set_load -pin_load 0.3 [get_ports {odata[1]}]
set_load -pin_load 0.3 [get_ports {odata[0]}]
set_load -pin_load 0.3 [get_ports out_valid]
set_max_transition 0.08 [get_ports {odata[31]}]
set_max_transition 0.08 [get_ports {odata[30]}]
set_max_transition 0.08 [get_ports {odata[29]}]
set_max_transition 0.08 [get_ports {odata[28]}]
set_max_transition 0.08 [get_ports {odata[27]}]
set_max_transition 0.08 [get_ports {odata[26]}]
set_max_transition 0.08 [get_ports {odata[25]}]
set_max_transition 0.08 [get_ports {odata[24]}]
set_max_transition 0.08 [get_ports {odata[23]}]
set_max_transition 0.08 [get_ports {odata[22]}]
set_max_transition 0.08 [get_ports {odata[21]}]
set_max_transition 0.08 [get_ports {odata[20]}]
set_max_transition 0.08 [get_ports {odata[19]}]
set_max_transition 0.08 [get_ports {odata[18]}]
set_max_transition 0.08 [get_ports {odata[17]}]
set_max_transition 0.08 [get_ports {odata[16]}]
set_max_transition 0.08 [get_ports {odata[15]}]
set_max_transition 0.08 [get_ports {odata[14]}]
set_max_transition 0.08 [get_ports {odata[13]}]
set_max_transition 0.08 [get_ports {odata[12]}]
set_max_transition 0.08 [get_ports {odata[11]}]
set_max_transition 0.08 [get_ports {odata[10]}]
set_max_transition 0.08 [get_ports {odata[9]}]
set_max_transition 0.08 [get_ports {odata[8]}]
set_max_transition 0.08 [get_ports {odata[7]}]
set_max_transition 0.08 [get_ports {odata[6]}]
set_max_transition 0.08 [get_ports {odata[5]}]
set_max_transition 0.08 [get_ports {odata[4]}]
set_max_transition 0.08 [get_ports {odata[3]}]
set_max_transition 0.08 [get_ports {odata[2]}]
set_max_transition 0.08 [get_ports {odata[1]}]
set_max_transition 0.08 [get_ports {odata[0]}]
set_max_transition 0.08 [get_ports out_valid]
create_clock [get_ports clk]  -name core_clk  -period 2  -waveform {0 1}
set_clock_latency 0.2  [get_clocks core_clk]
set_clock_uncertainty 0.2  [get_clocks core_clk]
set_clock_transition -max -rise 0.08 [get_clocks core_clk]
set_clock_transition -max -fall 0.08 [get_clocks core_clk]
set_clock_transition -min -rise 0.08 [get_clocks core_clk]
set_clock_transition -min -fall 0.08 [get_clocks core_clk]
group_path -name FEEDTHROUGH  -from [list [get_ports reset] [get_ports enable] [get_ports {idataA[31]}] [get_ports {idataA[30]}] [get_ports {idataA[29]}] [get_ports {idataA[28]}] [get_ports {idataA[27]}] [get_ports {idataA[26]}] [get_ports {idataA[25]}] [get_ports {idataA[24]}] [get_ports {idataA[23]}] [get_ports {idataA[22]}] [get_ports {idataA[21]}] [get_ports {idataA[20]}] [get_ports {idataA[19]}] [get_ports {idataA[18]}] [get_ports {idataA[17]}] [get_ports {idataA[16]}] [get_ports {idataA[15]}] [get_ports {idataA[14]}] [get_ports {idataA[13]}] [get_ports {idataA[12]}] [get_ports {idataA[11]}] [get_ports {idataA[10]}] [get_ports {idataA[9]}] [get_ports {idataA[8]}] [get_ports {idataA[7]}] [get_ports {idataA[6]}] [get_ports {idataA[5]}] [get_ports {idataA[4]}] [get_ports {idataA[3]}] [get_ports {idataA[2]}] [get_ports {idataA[1]}] [get_ports {idataA[0]}] [get_ports {idataB[31]}] [get_ports {idataB[30]}] [get_ports {idataB[29]}] [get_ports {idataB[28]}] [get_ports {idataB[27]}] [get_ports {idataB[26]}] [get_ports {idataB[25]}] [get_ports {idataB[24]}] [get_ports {idataB[23]}] [get_ports {idataB[22]}] [get_ports {idataB[21]}] [get_ports {idataB[20]}] [get_ports {idataB[19]}] [get_ports {idataB[18]}] [get_ports {idataB[17]}] [get_ports {idataB[16]}] [get_ports {idataB[15]}] [get_ports {idataB[14]}] [get_ports {idataB[13]}] [get_ports {idataB[12]}] [get_ports {idataB[11]}] [get_ports {idataB[10]}] [get_ports {idataB[9]}] [get_ports {idataB[8]}] [get_ports {idataB[7]}] [get_ports {idataB[6]}] [get_ports {idataB[5]}] [get_ports {idataB[4]}] [get_ports {idataB[3]}] [get_ports {idataB[2]}] [get_ports {idataB[1]}] [get_ports {idataB[0]}]]  -to [list [get_ports {odata[31]}] [get_ports {odata[30]}] [get_ports {odata[29]}] [get_ports {odata[28]}] [get_ports {odata[27]}] [get_ports {odata[26]}] [get_ports {odata[25]}] [get_ports {odata[24]}] [get_ports {odata[23]}] [get_ports {odata[22]}] [get_ports {odata[21]}] [get_ports {odata[20]}] [get_ports {odata[19]}] [get_ports {odata[18]}] [get_ports {odata[17]}] [get_ports {odata[16]}] [get_ports {odata[15]}] [get_ports {odata[14]}] [get_ports {odata[13]}] [get_ports {odata[12]}] [get_ports {odata[11]}] [get_ports {odata[10]}] [get_ports {odata[9]}] [get_ports {odata[8]}] [get_ports {odata[7]}] [get_ports {odata[6]}] [get_ports {odata[5]}] [get_ports {odata[4]}] [get_ports {odata[3]}] [get_ports {odata[2]}] [get_ports {odata[1]}] [get_ports {odata[0]}] [get_ports out_valid]]
group_path -name REGIN  -from [list [get_ports reset] [get_ports enable] [get_ports {idataA[31]}] [get_ports {idataA[30]}] [get_ports {idataA[29]}] [get_ports {idataA[28]}] [get_ports {idataA[27]}] [get_ports {idataA[26]}] [get_ports {idataA[25]}] [get_ports {idataA[24]}] [get_ports {idataA[23]}] [get_ports {idataA[22]}] [get_ports {idataA[21]}] [get_ports {idataA[20]}] [get_ports {idataA[19]}] [get_ports {idataA[18]}] [get_ports {idataA[17]}] [get_ports {idataA[16]}] [get_ports {idataA[15]}] [get_ports {idataA[14]}] [get_ports {idataA[13]}] [get_ports {idataA[12]}] [get_ports {idataA[11]}] [get_ports {idataA[10]}] [get_ports {idataA[9]}] [get_ports {idataA[8]}] [get_ports {idataA[7]}] [get_ports {idataA[6]}] [get_ports {idataA[5]}] [get_ports {idataA[4]}] [get_ports {idataA[3]}] [get_ports {idataA[2]}] [get_ports {idataA[1]}] [get_ports {idataA[0]}] [get_ports {idataB[31]}] [get_ports {idataB[30]}] [get_ports {idataB[29]}] [get_ports {idataB[28]}] [get_ports {idataB[27]}] [get_ports {idataB[26]}] [get_ports {idataB[25]}] [get_ports {idataB[24]}] [get_ports {idataB[23]}] [get_ports {idataB[22]}] [get_ports {idataB[21]}] [get_ports {idataB[20]}] [get_ports {idataB[19]}] [get_ports {idataB[18]}] [get_ports {idataB[17]}] [get_ports {idataB[16]}] [get_ports {idataB[15]}] [get_ports {idataB[14]}] [get_ports {idataB[13]}] [get_ports {idataB[12]}] [get_ports {idataB[11]}] [get_ports {idataB[10]}] [get_ports {idataB[9]}] [get_ports {idataB[8]}] [get_ports {idataB[7]}] [get_ports {idataB[6]}] [get_ports {idataB[5]}] [get_ports {idataB[4]}] [get_ports {idataB[3]}] [get_ports {idataB[2]}] [get_ports {idataB[1]}] [get_ports {idataB[0]}]]
group_path -name REGOUT  -to [list [get_ports {odata[31]}] [get_ports {odata[30]}] [get_ports {odata[29]}] [get_ports {odata[28]}] [get_ports {odata[27]}] [get_ports {odata[26]}] [get_ports {odata[25]}] [get_ports {odata[24]}] [get_ports {odata[23]}] [get_ports {odata[22]}] [get_ports {odata[21]}] [get_ports {odata[20]}] [get_ports {odata[19]}] [get_ports {odata[18]}] [get_ports {odata[17]}] [get_ports {odata[16]}] [get_ports {odata[15]}] [get_ports {odata[14]}] [get_ports {odata[13]}] [get_ports {odata[12]}] [get_ports {odata[11]}] [get_ports {odata[10]}] [get_ports {odata[9]}] [get_ports {odata[8]}] [get_ports {odata[7]}] [get_ports {odata[6]}] [get_ports {odata[5]}] [get_ports {odata[4]}] [get_ports {odata[3]}] [get_ports {odata[2]}] [get_ports {odata[1]}] [get_ports {odata[0]}] [get_ports out_valid]]
