###################################################################

# Created by write_sdc on Fri Dec 6 21:28:08 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.1 [current_design]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports clk]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports reset]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[31]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[30]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[29]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[28]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[27]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[26]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[25]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[24]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[23]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[22]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[21]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[20]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[19]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[18]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[17]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[16]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[31]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[30]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[29]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[28]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[27]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[26]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[25]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[24]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[23]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[22]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[21]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[20]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[19]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[18]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[17]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[16]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[0]}]
set_load -pin_load 0.1 [get_ports {cos[31]}]
set_load -pin_load 0.1 [get_ports {cos[30]}]
set_load -pin_load 0.1 [get_ports {cos[29]}]
set_load -pin_load 0.1 [get_ports {cos[28]}]
set_load -pin_load 0.1 [get_ports {cos[27]}]
set_load -pin_load 0.1 [get_ports {cos[26]}]
set_load -pin_load 0.1 [get_ports {cos[25]}]
set_load -pin_load 0.1 [get_ports {cos[24]}]
set_load -pin_load 0.1 [get_ports {cos[23]}]
set_load -pin_load 0.1 [get_ports {cos[22]}]
set_load -pin_load 0.1 [get_ports {cos[21]}]
set_load -pin_load 0.1 [get_ports {cos[20]}]
set_load -pin_load 0.1 [get_ports {cos[19]}]
set_load -pin_load 0.1 [get_ports {cos[18]}]
set_load -pin_load 0.1 [get_ports {cos[17]}]
set_load -pin_load 0.1 [get_ports {cos[16]}]
set_load -pin_load 0.1 [get_ports {cos[15]}]
set_load -pin_load 0.1 [get_ports {cos[14]}]
set_load -pin_load 0.1 [get_ports {cos[13]}]
set_load -pin_load 0.1 [get_ports {cos[12]}]
set_load -pin_load 0.1 [get_ports {cos[11]}]
set_load -pin_load 0.1 [get_ports {cos[10]}]
set_load -pin_load 0.1 [get_ports {cos[9]}]
set_load -pin_load 0.1 [get_ports {cos[8]}]
set_load -pin_load 0.1 [get_ports {cos[7]}]
set_load -pin_load 0.1 [get_ports {cos[6]}]
set_load -pin_load 0.1 [get_ports {cos[5]}]
set_load -pin_load 0.1 [get_ports {cos[4]}]
set_load -pin_load 0.1 [get_ports {cos[3]}]
set_load -pin_load 0.1 [get_ports {cos[2]}]
set_load -pin_load 0.1 [get_ports {cos[1]}]
set_load -pin_load 0.1 [get_ports {cos[0]}]
set_load -pin_load 0.1 [get_ports {sin[31]}]
set_load -pin_load 0.1 [get_ports {sin[30]}]
set_load -pin_load 0.1 [get_ports {sin[29]}]
set_load -pin_load 0.1 [get_ports {sin[28]}]
set_load -pin_load 0.1 [get_ports {sin[27]}]
set_load -pin_load 0.1 [get_ports {sin[26]}]
set_load -pin_load 0.1 [get_ports {sin[25]}]
set_load -pin_load 0.1 [get_ports {sin[24]}]
set_load -pin_load 0.1 [get_ports {sin[23]}]
set_load -pin_load 0.1 [get_ports {sin[22]}]
set_load -pin_load 0.1 [get_ports {sin[21]}]
set_load -pin_load 0.1 [get_ports {sin[20]}]
set_load -pin_load 0.1 [get_ports {sin[19]}]
set_load -pin_load 0.1 [get_ports {sin[18]}]
set_load -pin_load 0.1 [get_ports {sin[17]}]
set_load -pin_load 0.1 [get_ports {sin[16]}]
set_load -pin_load 0.1 [get_ports {sin[15]}]
set_load -pin_load 0.1 [get_ports {sin[14]}]
set_load -pin_load 0.1 [get_ports {sin[13]}]
set_load -pin_load 0.1 [get_ports {sin[12]}]
set_load -pin_load 0.1 [get_ports {sin[11]}]
set_load -pin_load 0.1 [get_ports {sin[10]}]
set_load -pin_load 0.1 [get_ports {sin[9]}]
set_load -pin_load 0.1 [get_ports {sin[8]}]
set_load -pin_load 0.1 [get_ports {sin[7]}]
set_load -pin_load 0.1 [get_ports {sin[6]}]
set_load -pin_load 0.1 [get_ports {sin[5]}]
set_load -pin_load 0.1 [get_ports {sin[4]}]
set_load -pin_load 0.1 [get_ports {sin[3]}]
set_load -pin_load 0.1 [get_ports {sin[2]}]
set_load -pin_load 0.1 [get_ports {sin[1]}]
set_load -pin_load 0.1 [get_ports {sin[0]}]
set_max_transition 0.08 [get_ports {cos[31]}]
set_max_transition 0.08 [get_ports {cos[30]}]
set_max_transition 0.08 [get_ports {cos[29]}]
set_max_transition 0.08 [get_ports {cos[28]}]
set_max_transition 0.08 [get_ports {cos[27]}]
set_max_transition 0.08 [get_ports {cos[26]}]
set_max_transition 0.08 [get_ports {cos[25]}]
set_max_transition 0.08 [get_ports {cos[24]}]
set_max_transition 0.08 [get_ports {cos[23]}]
set_max_transition 0.08 [get_ports {cos[22]}]
set_max_transition 0.08 [get_ports {cos[21]}]
set_max_transition 0.08 [get_ports {cos[20]}]
set_max_transition 0.08 [get_ports {cos[19]}]
set_max_transition 0.08 [get_ports {cos[18]}]
set_max_transition 0.08 [get_ports {cos[17]}]
set_max_transition 0.08 [get_ports {cos[16]}]
set_max_transition 0.08 [get_ports {cos[15]}]
set_max_transition 0.08 [get_ports {cos[14]}]
set_max_transition 0.08 [get_ports {cos[13]}]
set_max_transition 0.08 [get_ports {cos[12]}]
set_max_transition 0.08 [get_ports {cos[11]}]
set_max_transition 0.08 [get_ports {cos[10]}]
set_max_transition 0.08 [get_ports {cos[9]}]
set_max_transition 0.08 [get_ports {cos[8]}]
set_max_transition 0.08 [get_ports {cos[7]}]
set_max_transition 0.08 [get_ports {cos[6]}]
set_max_transition 0.08 [get_ports {cos[5]}]
set_max_transition 0.08 [get_ports {cos[4]}]
set_max_transition 0.08 [get_ports {cos[3]}]
set_max_transition 0.08 [get_ports {cos[2]}]
set_max_transition 0.08 [get_ports {cos[1]}]
set_max_transition 0.08 [get_ports {cos[0]}]
set_max_transition 0.08 [get_ports {sin[31]}]
set_max_transition 0.08 [get_ports {sin[30]}]
set_max_transition 0.08 [get_ports {sin[29]}]
set_max_transition 0.08 [get_ports {sin[28]}]
set_max_transition 0.08 [get_ports {sin[27]}]
set_max_transition 0.08 [get_ports {sin[26]}]
set_max_transition 0.08 [get_ports {sin[25]}]
set_max_transition 0.08 [get_ports {sin[24]}]
set_max_transition 0.08 [get_ports {sin[23]}]
set_max_transition 0.08 [get_ports {sin[22]}]
set_max_transition 0.08 [get_ports {sin[21]}]
set_max_transition 0.08 [get_ports {sin[20]}]
set_max_transition 0.08 [get_ports {sin[19]}]
set_max_transition 0.08 [get_ports {sin[18]}]
set_max_transition 0.08 [get_ports {sin[17]}]
set_max_transition 0.08 [get_ports {sin[16]}]
set_max_transition 0.08 [get_ports {sin[15]}]
set_max_transition 0.08 [get_ports {sin[14]}]
set_max_transition 0.08 [get_ports {sin[13]}]
set_max_transition 0.08 [get_ports {sin[12]}]
set_max_transition 0.08 [get_ports {sin[11]}]
set_max_transition 0.08 [get_ports {sin[10]}]
set_max_transition 0.08 [get_ports {sin[9]}]
set_max_transition 0.08 [get_ports {sin[8]}]
set_max_transition 0.08 [get_ports {sin[7]}]
set_max_transition 0.08 [get_ports {sin[6]}]
set_max_transition 0.08 [get_ports {sin[5]}]
set_max_transition 0.08 [get_ports {sin[4]}]
set_max_transition 0.08 [get_ports {sin[3]}]
set_max_transition 0.08 [get_ports {sin[2]}]
set_max_transition 0.08 [get_ports {sin[1]}]
set_max_transition 0.08 [get_ports {sin[0]}]
create_clock [get_ports clk]  -name core_clk  -period 14  -waveform {0 7}
set_clock_latency 0.1  [get_clocks core_clk]
set_clock_uncertainty 0.35  [get_clocks core_clk]
set_clock_transition -max -rise 0.08 [get_clocks core_clk]
set_clock_transition -max -fall 0.08 [get_clocks core_clk]
set_clock_transition -min -rise 0.08 [get_clocks core_clk]
set_clock_transition -min -fall 0.08 [get_clocks core_clk]
group_path -name FEEDTHROUGH  -from [list [get_ports reset] [get_ports {a[31]}] [get_ports {a[30]}] [get_ports {a[29]}] [get_ports {a[28]}] [get_ports {a[27]}] [get_ports {a[26]}] [get_ports {a[25]}] [get_ports {a[24]}] [get_ports {a[23]}] [get_ports {a[22]}] [get_ports {a[21]}] [get_ports {a[20]}] [get_ports {a[19]}] [get_ports {a[18]}] [get_ports {a[17]}] [get_ports {a[16]}] [get_ports {a[15]}] [get_ports {a[14]}] [get_ports {a[13]}] [get_ports {a[12]}] [get_ports {a[11]}] [get_ports {a[10]}] [get_ports {a[9]}] [get_ports {a[8]}] [get_ports {a[7]}] [get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}] [get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[31]}] [get_ports {b[30]}] [get_ports {b[29]}] [get_ports {b[28]}] [get_ports {b[27]}] [get_ports {b[26]}] [get_ports {b[25]}] [get_ports {b[24]}] [get_ports {b[23]}] [get_ports {b[22]}] [get_ports {b[21]}] [get_ports {b[20]}] [get_ports {b[19]}] [get_ports {b[18]}] [get_ports {b[17]}] [get_ports {b[16]}] [get_ports {b[15]}] [get_ports {b[14]}] [get_ports {b[13]}] [get_ports {b[12]}] [get_ports {b[11]}] [get_ports {b[10]}] [get_ports {b[9]}] [get_ports {b[8]}] [get_ports {b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports {b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}]]  -to [list [get_ports {cos[31]}] [get_ports {cos[30]}] [get_ports {cos[29]}] [get_ports {cos[28]}] [get_ports {cos[27]}] [get_ports {cos[26]}] [get_ports {cos[25]}] [get_ports {cos[24]}] [get_ports {cos[23]}] [get_ports {cos[22]}] [get_ports {cos[21]}] [get_ports {cos[20]}] [get_ports {cos[19]}] [get_ports {cos[18]}] [get_ports {cos[17]}] [get_ports {cos[16]}] [get_ports {cos[15]}] [get_ports {cos[14]}] [get_ports {cos[13]}] [get_ports {cos[12]}] [get_ports {cos[11]}] [get_ports {cos[10]}] [get_ports {cos[9]}] [get_ports {cos[8]}] [get_ports {cos[7]}] [get_ports {cos[6]}] [get_ports {cos[5]}] [get_ports {cos[4]}] [get_ports {cos[3]}] [get_ports {cos[2]}] [get_ports {cos[1]}] [get_ports {cos[0]}] [get_ports {sin[31]}] [get_ports {sin[30]}] [get_ports {sin[29]}] [get_ports {sin[28]}] [get_ports {sin[27]}] [get_ports {sin[26]}] [get_ports {sin[25]}] [get_ports {sin[24]}] [get_ports {sin[23]}] [get_ports {sin[22]}] [get_ports {sin[21]}] [get_ports {sin[20]}] [get_ports {sin[19]}] [get_ports {sin[18]}] [get_ports {sin[17]}] [get_ports {sin[16]}] [get_ports {sin[15]}] [get_ports {sin[14]}] [get_ports {sin[13]}] [get_ports {sin[12]}] [get_ports {sin[11]}] [get_ports {sin[10]}] [get_ports {sin[9]}] [get_ports {sin[8]}] [get_ports {sin[7]}] [get_ports {sin[6]}] [get_ports {sin[5]}] [get_ports {sin[4]}] [get_ports {sin[3]}] [get_ports {sin[2]}] [get_ports {sin[1]}] [get_ports {sin[0]}]]
group_path -name REGIN  -from [get_ports reset]
group_path -name REGIN  -from [list [get_ports {a[31]}] [get_ports {a[30]}] [get_ports {a[29]}] [get_ports {a[28]}] [get_ports {a[27]}] [get_ports {a[26]}] [get_ports {a[25]}] [get_ports {a[24]}] [get_ports {a[23]}] [get_ports {a[22]}] [get_ports {a[21]}] [get_ports {a[20]}] [get_ports {a[19]}] [get_ports {a[18]}] [get_ports {a[17]}] [get_ports {a[16]}] [get_ports {a[15]}] [get_ports {a[14]}] [get_ports {a[13]}] [get_ports {a[12]}] [get_ports {a[11]}] [get_ports {a[10]}] [get_ports {a[9]}] [get_ports {a[8]}] [get_ports {a[7]}] [get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}] [get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[31]}] [get_ports {b[30]}] [get_ports {b[29]}] [get_ports {b[28]}] [get_ports {b[27]}] [get_ports {b[26]}] [get_ports {b[25]}] [get_ports {b[24]}] [get_ports {b[23]}] [get_ports {b[22]}] [get_ports {b[21]}] [get_ports {b[20]}] [get_ports {b[19]}] [get_ports {b[18]}] [get_ports {b[17]}] [get_ports {b[16]}] [get_ports {b[15]}] [get_ports {b[14]}] [get_ports {b[13]}] [get_ports {b[12]}] [get_ports {b[11]}] [get_ports {b[10]}] [get_ports {b[9]}] [get_ports {b[8]}] [get_ports {b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports {b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}]]
group_path -name REGOUT  -to [list [get_ports {cos[31]}] [get_ports {cos[30]}] [get_ports {cos[29]}] [get_ports {cos[28]}] [get_ports {cos[27]}] [get_ports {cos[26]}] [get_ports {cos[25]}] [get_ports {cos[24]}] [get_ports {cos[23]}] [get_ports {cos[22]}] [get_ports {cos[21]}] [get_ports {cos[20]}] [get_ports {cos[19]}] [get_ports {cos[18]}] [get_ports {cos[17]}] [get_ports {cos[16]}] [get_ports {cos[15]}] [get_ports {cos[14]}] [get_ports {cos[13]}] [get_ports {cos[12]}] [get_ports {cos[11]}] [get_ports {cos[10]}] [get_ports {cos[9]}] [get_ports {cos[8]}] [get_ports {cos[7]}] [get_ports {cos[6]}] [get_ports {cos[5]}] [get_ports {cos[4]}] [get_ports {cos[3]}] [get_ports {cos[2]}] [get_ports {cos[1]}] [get_ports {cos[0]}] [get_ports {sin[31]}] [get_ports {sin[30]}] [get_ports {sin[29]}] [get_ports {sin[28]}] [get_ports {sin[27]}] [get_ports {sin[26]}] [get_ports {sin[25]}] [get_ports {sin[24]}] [get_ports {sin[23]}] [get_ports {sin[22]}] [get_ports {sin[21]}] [get_ports {sin[20]}] [get_ports {sin[19]}] [get_ports {sin[18]}] [get_ports {sin[17]}] [get_ports {sin[16]}] [get_ports {sin[15]}] [get_ports {sin[14]}] [get_ports {sin[13]}] [get_ports {sin[12]}] [get_ports {sin[11]}] [get_ports {sin[10]}] [get_ports {sin[9]}] [get_ports {sin[8]}] [get_ports {sin[7]}] [get_ports {sin[6]}] [get_ports {sin[5]}] [get_ports {sin[4]}] [get_ports {sin[3]}] [get_ports {sin[2]}] [get_ports {sin[1]}] [get_ports {sin[0]}]]
set_false_path   -from [get_ports reset]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[31]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[31]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[30]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[30]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[29]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[29]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[28]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[28]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[27]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[27]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[26]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[26]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[25]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[25]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[24]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[24]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[23]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[23]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[22]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[22]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[21]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[21]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[20]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[20]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[19]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[19]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[18]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[18]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[17]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[17]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[16]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[16]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[15]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[15]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[14]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[14]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[13]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[13]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[12]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[12]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[11]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[11]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[10]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[10]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[9]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[9]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[8]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[8]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[7]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[7]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[6]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[6]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[5]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[5]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[4]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[4]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[3]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[3]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[2]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[2]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[1]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[1]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {a[0]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {a[0]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[31]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[31]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[30]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[30]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[29]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[29]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[28]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[28]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[27]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[27]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[26]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[26]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[25]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[25]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[24]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[24]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[23]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[23]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[22]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[22]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[21]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[21]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[20]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[20]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[19]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[19]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[18]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[18]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[17]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[17]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[16]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[16]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[15]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[15]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[14]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[14]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[13]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[13]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[12]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[12]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[11]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[11]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[10]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[10]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[9]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[9]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[8]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[8]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[7]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[7]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[6]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[6]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[5]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[5]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[4]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[4]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[3]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[3]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[2]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[2]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[1]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[1]}]
set_input_delay -clock core_clk  -max 0.28  [get_ports {b[0]}]
set_input_delay -clock core_clk  -min 0.14  [get_ports {b[0]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[31]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[31]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[30]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[30]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[29]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[29]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[28]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[28]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[27]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[27]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[26]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[26]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[25]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[25]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[24]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[24]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[23]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[23]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[22]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[22]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[21]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[21]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[20]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[20]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[19]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[19]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[18]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[18]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[17]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[17]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[16]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[16]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[15]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[15]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[14]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[14]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[13]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[13]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[12]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[12]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[11]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[11]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[10]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[10]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[9]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[9]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[8]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[8]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[7]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[7]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[6]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[6]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[5]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[5]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[4]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[4]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[3]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[3]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[2]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[2]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[1]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[1]}]
set_output_delay -clock core_clk  -max 0.42  [get_ports {cos[0]}]
set_output_delay -clock core_clk  -min 0.28  [get_ports {cos[0]}]
